[
    {
        "source": "BDF",
        "name": "AKINAKA",
        "mechtype": ["Support","Controller"],
        "image_url": "",
        "y_pos": 0,
        "description": "",
        "mounts": ["Flex"],
        "stats": {
            "size": 1,
            "armor": 0,
            "hp": 8,
            "evasion": 7,
            "edef": 10,
            "heatcap": 5,
            "repcap": 8,
            "sensor_range": 15,
            "tech_attack": 1,
            "save": 11,
            "speed": 4,
            "sp": 8
        },
        "traits": [
            {
                "name": "Weak",
                "description": "+1 difficulty on Hull Saves"
            },
            {
                "name": "Eye of the Storm",
                "description": "1/round the Akinaka is immune to damage and effects from an area of effect attack or save, hostile or allied."
            }
        ],
        "core_system": {
            "name": "",
            "description": "",
            "passive_name": "Whale beacon",
            "passive_effect": "1/round you can detonate a Drone as a Full Action, destroying it, to create an area originating from the drone's space from the list provided:<li>Line 10, width 3<li>Blast 2<li>three Blast 1 explosions in Range 5 for +1d6 extra damage<br>enemies in this area at the start of your next turn take 2d6 damage, half on a hull save; 1/scene if an enemy is killed by a Whale Beacon, gain a repair.",
            "active_name": "One in the pocket",
            "active_effect": "1/scene you can activate the whale beacon immediately on a target in ; Whale Beacon's damage is permanently increased to 3d6 damage instead of 2d6 for the rest of the scene.",
            "tags": [{"id": "tg_full_action"}]
        }
    },
    {
        "source": "BDF",
        "name": "AKRAFENA",
        "mechtype": ["Striker","Controller"],
        "image_url": "https://cdn.discordapp.com/attachments/711937493787738194/713542625831026788/Akrafena1080.png",
        "y_pos": 0,
        "description": "Advances in subjectivity interfacing firmware allows the Baronic Defense Forces a novel opportunity to augment infantry: a mech’s firepower mounted to a hardsuit through a backpack harness and stabilizing legs. Additional plating and energy-based interception screens protect the pilot from incoming fire which would otherwise incapacitate a dismounted soldier. Originally designed as a fire support frame for infantry platoons, noble commanders immediately began to retrofit the frame for duels with other forces’ commanding officers. The frame’s offensive maneuverability scales non-linearly with the pilot’s willingness to exceed factory specifications and disregard their own safety.",
        "mounts": ["Main","Main","Main","Main"],
        "stats": {
            "size": 0.5,
            "armor": 1,
            "hp": 8,
            "evasion": 6,
            "edef": 8,
            "heatcap": 6,
            "repcap": 5,
            "sensor_range": 5,
            "tech_attack": 0,
            "save": 10,
            "speed": 3,
            "sp": 5
        },
        "traits": [
            {
                "name": "MOUNT RULES",
                "description": "Hi, this is here to tell you that the 4 main mounts are - in fact - 2 Main/Main mount. Its Aux/Aux but with Mains!<br>The the two on the left half are as far as the rules are concerned linked (so if you have two loading weapons and fire that mount they're both unloaded), same goes for the pair on the right.<br>Apologies that this couldn't be done in a cleaner way - maybe in the future"
            },
            {
                "name": "Weapon Bracing",
                "description": "After firing a weapon, the Akrafena cannot fire weapons from any other mount until the start of its next turn."
            },
            {
                "name": "Reactive Thrusters",
                "description": "When the Akrafena Boosts, it cannot be knocked back, pushed, pulled, or be knocked prone by actors up to its size +1 (rounded up) until the start of its next turn."
            },
            {
                "name": "Slow",
                "description": "The Akrafena has +1 Difficulty on agility checks and saves."
            }
        ],
        "core_system": {
            "name": "PEDIPALPS Augmented Hardpoints",
            "description": "Integrated additional limbs and recoil stabilizers allow a terrifying volume of sustained fire. During spikes of reactor activity, static defense capabilities surge as weapons are reloaded by tertiary limbs as fast as they cycle.",
            "passive_name": "Lock and Cycle",
            "passive_effect": "The Akrafena can fire a weapon and reload as a full action. This counts as a Barrage. The Akrafena is Slowed until the start of its next turn after using this action.",
            "active_name": "Synchronize Limbs",
            "active_effect": "After using this protocol, for the rest of this scene, the Akrafena can fire 2 weapons and reload 2 weapons when it uses Lock and Cycle.",
            "tags": [{"id": "tg_protocol"}]
        },
        "data_type": "frame",
        "aptitude": {}
    },
    {
        "source": "BDF",
        "name": "DAO",
        "mechtype": ["Support","Artillery"],
        "image_url": "",
        "y_pos": 0,
        "description": "",
        "mounts": ["Main/Aux","Main"],
        "stats": {
            "size": 2,
            "armor": 1,
            "hp": 8,
            "evasion": 8,
            "edef": 9,
            "heatcap": 5,
            "repcap": 3,
            "sensor_range": 12,
            "tech_attack": 1,
            "save": 10,
            "speed": 4,
            "sp": 7
        },
        "traits": [
            {
                "name": "",
                "description": "Drones have +2 HP and +2 Evasion and E-Defense"
            },
            {
                "name": "Bottom Heavy",
                "description": "The Dao is Immobilized when Prone. It can still stand up from Prone."
            },
            {
                "name": "Guardian",
                "description": "Adjacent allies may use the Dao as Hard Cover."
            }
        ],
        "core_system": {
            "name": "",
            "passive_name": "Print Subaltern Drone",
            "passive_effect": "Your mech can print independent Drone companions. This drone can be deployed in an adjacent space. The Subaltern Drone shares your EVASION, E-DEFENSE, and SPEED. This drone can attack targets as a reaction<br><br>Subaltern Drone (SIZE 1/2, [10+GRIT] HP, EVASION/E-DEFENSE, Tags: DRONE)<br><br>Begin the scene with 1 Subaltern Drone already in play.",
            "active_name": "Full Deployment",
            "active_effect": "Create 3 Subaltern Drones. In addition, gain the Shed Armor reaction.<br>Shed Armor<br>1/scene, Reaction<br>Trigger: You are hit by an attack or fail a hostile save and learn the damage or hostile effect.<br>Effect: Become Immune to the attack or save’s damage, heat, and all other effects. Until the end of the scene, after activating this reaction, your size is reduced by 1, your armor is reduced by 1, and you gain 2 speed. A size 2 object is created in an adjacent square that grants Hard Cover as well as resistance to all damage and heat to characters behind it.",
            "description": "The most WIP thing in this LCP and we have more mechs to add so that says something.",
            "tags": [{"id": "tg_protocol"}]
        },
        "data_type": "frame",
        "aptitude": {}
    },
    {
        "source": "BDF",
        "name": "JIAN",
        "mechtype": ["Striker"],
        "image_url": "",
        "y_pos": 0,
        "description": "Baronic Unified Command issued procurement for a line mech to rival the capacity of the Harrison Armory Sherman, and the Jian is the BDF’s response.  Designed as a stick and move chassis around a lighter frame with rapid maneuver capability to integrate with infantry deployment, the Jian mounts enough firepower to disable softer armored targets and enough supplemental",
        "mounts": ["Main","Main"],
        "stats": {
            "size": 1,
            "armor": 0,
            "hp": 10,
            "evasion": 9,
            "edef": 7,
            "heatcap": 6,
            "repcap": 4,
            "sensor_range": 8,
            "tech_attack": -1,
            "save": 11,
            "speed": 4,
            "sp": 6
        },
        "traits": [
            {
                "name": "Experimental Munitions",
                "description": "Grenades have extra throw range equal to the last movement you made in a straight line and explode with +1d6 Explosive damage, targets may make an AGILITY save for half damage in a Blast 1 area of the targeted space if you self immobilize until your next turn as part of the grenade system activation."
            },
            {
                "name": "Combat Roll",
                "description": "1/turn when an attack misses you, move 1 space. If this causes you to collide with an object or terrain, deal 10 AP KINETIC damage to the object or terrain."
            },
            {
                "name": "Top Heavy",
                "description": "The Jian has +1 Difficulty on all saves vs Prone, Knockback, or Involuntary Movement."
            }
        ],
        "core_system": {
            "name": "",
            "description": "<i>While mechanized cavalry chassis legs are a tangible advantage in rugged terrain, open plains and paved roads require additional tools to compete with armor.  Specialized modular drones can reconfigure to allow for rapid deployment of frames and dismounted pilots alike.</i>",
            "active_name": "“Moonlight” Combat Cycle",
            "active_effect": "Summon two Line 2 Drones with 20HP - they can combine to hold a size 2 actor or they can hold 1 size 1 or 1/2 actor each; mount as a Quick, they move 6 spaces at the start of your turn and you can fire a Line 5 machine Gun for 2 damage as a protocol; you can prime a Self Destruct on each one independently.",
            "tags": [{"id": "tg_protocol"}]
        },
        "data_type": "frame",
        "aptitude": {}
    },
    {
        "source": "BDF",
        "name": "KAMPILAN",
        "mechtype": ["Support","Defender"],
        "image_url": "https://cdn.discordapp.com/attachments/711937493787738194/713541792846446592/KampilanSketch.jpeg",
        "y_pos": 0,
        "description": "The Ungratefuls uprising across the Baronies requires infantry augmentation beyond the capabilities of a single hardsuit.",
        "mounts": ["Aux/Aux"],
        "stats": {
            "size": 0.5,
            "armor": 0,
            "hp": 6,
            "evasion": 10,
            "edef": 8,
            "heatcap": 5,
            "repcap": 6,
            "sensor_range": 15,
            "tech_attack": 1,
            "save": 10,
            "speed": 5,
            "sp": 8
        },
        "traits": [
            {
                "name": "Electronic Impulse Muscles",
                "description": "1/round, the Kampilan gains +1d6 bonus damage on its next attack after causing involuntary movement to another character."
            },
            {
                "name": "Subjectivity Diffusion Engines",
                "description": "The Kampilan never rolls more than one die for Structure checks."
            },
            {
                "name": "Plasteel Enhanced Frame",
                "description": "If the Kampilan moves at least 6 spaces in a round, 1/round it can move 3 spaces in the same direction as its last movement as a free action."
            }
        ],
        "core_system": {
            "name": "",
            "description": "",
            "active_name": "Nuclear Dismount",
            "active_effect": "1/scene, the Kampilan pilot can choose to overcharge the coldcore reactor on the frame. This causes the mech to prime a Self Destruct with a blast 4 profile instead of a blast 2. The Self Destruct activates immediately if the pilot Ejects or if the frame experiences a Direct Hit roll on a Structure Check. After Dismounting or Ejecting, until the end of the scene the Kampilan’s pilot can make Improvised Attack actions as if mounted, using the mech traits, systems, and mech talents of the Kampilan.",
            "integrated": {"id": "bdf_binary_laser"},
            "tags": [{"id": "tg_full_action"}]
        },
        "data_type": "frame",
        "aptitude": {}
    },
    {
        "source": "BDF",
        "name": "KLEWANG",
        "mechtype": ["Striker","Controller"],
        "image_url": "https://cdn.discordapp.com/attachments/711937493787738194/713541803256578188/KlewangSketch.png",
        "y_pos": 0,
        "description": "A repurposed cargo loader frame, the Klewang is designed to close the gap under fire from enemy artillery to break the defensive lines, allowing infantry to surge through.",
        "mounts": ["Flex","Main","Heavy"],
        "stats": {
            "size": 3,
            "armor": 2,
            "hp": 9,
            "evasion": 6,
            "edef": 6,
            "heatcap": 5,
            "repcap": 6,
            "sensor_range": 3,
            "tech_attack": -2,
            "save": 10,
            "speed": 2,
            "sp": 5
        },
        "traits": [
            {
                "name": "Top Heavy",
                "description": "The Klewang has +1 Difficulty on all saves vs Prone, Knockback, or Involuntary Movement"
            },
            {
                "name": "Aggressive Underhooks",
                "description": "The Klewang has +1 to HULL saves and Checks while Grappling and can maintain active Grapples at up to range 3 (the Klewang losing adjacency does not break grapples until the grapple participant is 4 or more spaces away)."
            },
            {
                "name": "Follow-Through",
                "description": "The Klewang can move 2 spaces as a free action when hitting with a melee attack; this movement must be directly towards an enemy character (not necessarily the original target). If the Kulewang moves at least 4 spaces in a round, 1/round it can move 2 additional spaces as a free action."
            }
        ],
        "core_system": {
            "name": "",
            "description": "<i>Mechs aren’t supposed to bend like that.</i>",
            "passive_name": "Suplex",
            "passive_effect": "The Klewang can, as a Full Action, fly 3 spaces and initiate a Grapple; if the attack roll is successful, it may switch positions with the Grapple target.",
            "active_name": "Six Meters Under",
            "active_effect": "Until the end of the scene, the Klewang creates a Cone 5 shockwave for 2d6 Explosive damage when it activates Suplex or Boosts in the direction of the nearest enemy character. Characters caught in the area who pass a HULL save take half damage. ",
            "tags": [{"id": "tg_full_action"}]
        },
        "data_type": "frame",
        "aptitude": {}
    },
    {
        "source": "BDF",
        "name": "SHOTEL",
        "mechtype": ["Striker"],
        "image_url": "https://cdn.discordapp.com/attachments/711937493787738194/713541820843556944/ShotelSketch.jpeg",
        "y_pos": 0,
        "description": "The BDF Shotel is the Baronies’ attempt to weaponize infantry in anti-ship actions in zero G with a design emphasis on sustained operations without external resupply.  Advanced radiator systems allow for controlled heat bleed even in the vacuum of space, and an integrated flight unit in the frame’s legs allows for rapid repositioning and fire support to frontline boarding frames.  Baronic nobles immediately neglected its intended use and took Shotel prototypes to duels, jousts, and high profile criminal cases involving obfuscating forensic investigations.  The concerns with payload weight and ability to maintain flight under fire relegated the Shotel to use by special forces on search and destroy operations rather than widespread infantry adoption.",
        "mounts": ["Main","Main"],
        "stats": {
            "size": 0.5,
            "armor": 0,
            "hp": 6,
            "evasion": 10,
            "edef": 6,
            "heatcap": 7,
            "repcap": 3,
            "sensor_range": 8,
            "tech_attack": 0,
            "save": 10,
            "speed": 4,
            "sp": 6
        },
        "traits": [
            {
                "name": "HiveFlight Boosters",
                "description": "The Shotel can fly when it moves.  When it begins the turn flying and lands after moving at least 2 spaces, its next attack can be drawn from a space half that many spaces away in the same direction as the Shotel’s last movement and within line of sight."
            },
            {
                "name": "Heat Bleed",
                "description": "At the end of its turn, the Shotel cools 2 Heat. When it takes stress or structure damage, this effect ceases until the end of its next turn."
            },
            {
                "name": "Exposed Reactor",
                "description": "The Shotel receives +1 Difficulty on Engineering checks and saves."
            }
        ],
        "core_system": {
            "name": "",
            "description": "",
            "active_name": "Pandora's Pepperbox",
            "active_effect": "Your Heat cools to zero.  Choose a space within Range 5 and mark a Cone 7 area; at start of your next two turns, all characters and objects caught inside take on failed Agility save take 2d6 Energy plus your Heat value when you activated this protocol, and half damage on a successful save.",
            "tags": [{"id": "tg_protocol"}]
        },
        "data_type": "frame",
        "aptitude": {}
    }
]