[
    {
        "id": "bdf_akinaka",
        "license_level": 2,
        "source": "BDF",
        "name": "AKINAKA",
        "mechtype": ["Controller","Support"],
        "y_pos": 0,
        "description": "",
        "mounts": ["Aux/Aux","Flex"],
        "stats": {
            "size": 1,
            "structure": 4,
            "stress": 4,
            "armor": 0,
            "hp": 8,
            "evasion": 7,
            "edef": 10,
            "heatcap": 5,
            "repcap": 8,
            "sensor_range": 15,
            "tech_attack": 1,
            "save": 11,
            "speed": 4,
            "sp": 8
        },
        "traits": [
            {
                "name": "Eye of the storm",
                "description": "1/round the Akinaka is IMMUNE to the damage and effects of an attack or save caused by a BLAST, CONE, BURST, or LINE area, from either itself, a hostile source or an allied source.",
                "use": "Round"
            },
            {
                "name": "Weak",
                "description": "The Akinaka has +1 Difficulty on HULL saves.",
                "synergies": [
                    {
                        "locations": ["hull","skill_check"],
                        "detail": "Gain +1 Difficulty on HULL checks and saves."
                    }
                ]
            }
        ],
        "core_system": {
            "name": "Whale Beacon",
            "description": "Boots on the ground need eyes in the sky. The Akinaka has an integrated communication suite allowing laser painting of fire support from artillery, close air support, and orbital strikes, depending on the battlefield.",
            "active_name": "One In The Pocket",
            "active_effect": "1/scene you can activate the Whale Beacon immediately on a target in Sensors; Whale Beacon damage upgrades to 3d6 EXPLOSIVE damage base for the rest of the scene.",
            "use": "Encounter",
            "activation": "Full",
            "passive_name": "Whale Beacon",
            "passive_actions": [
                {
                    "name": "Whale Beacon",
                    "activation": "Quick",
                    "detail": "Detonate a Drone as a Quick Action, destroying it. This creates an area originating from the drone's space in one of these sizes: (Line 8, 3 wide; Blast 2 within range 5 of the targeted Drone; or three Blast 1 areas within Range 3 of the targeted zone that deal an additional 3 Knockback); enemies in these areas at the start of your next turn take 2d6 EXPLOSIVE damage, half on a hull save; 1/scene if an enemy is killed by a Whale Beacon, gain a repair.",
                    "use": "round"
                }
            ]
        }
    },
    {
        "id": "bdf_akrafena",
        "license_level": 2,
        "source": "BDF",
        "name": "AKRAFENA",
        "mechtype": ["Striker","Controller"],
        "y_pos": 0,
        "description": "Advances in subjectivity interfacing firmware allows the Baronic Defense Forces a novel opportunity to augment infantry: a mech’s firepower mounted to a hardsuit through a backpack harness and stabilizing legs. Additional plating and energy-based interception screens protect the pilot from incoming fire which would otherwise incapacitate a dismounted soldier. Originally designed as a fire support frame for infantry platoons, noble commanders immediately began to retrofit the frame for duels with other forces’ commanding officers. The frame’s offensive maneuverability scales non-linearly with the pilot’s willingness to exceed factory specifications and disregard their own safety.",
        "mounts": ["Main","Main","Main","Main"],
        "stats": {
            "size": 0.5,
            "structure": 4,
            "stress": 4,
            "armor": 1,
            "hp": 8,
            "evasion": 6,
            "edef": 8,
            "heatcap": 6,
            "repcap": 5,
            "sensor_range": 5,
            "tech_attack": 0,
            "save": 10,
            "speed": 3,
            "sp": 5
        },
        "traits": [
            {
                "name": "Weapon Bracing",
                "description": "After firing a weapon, the Akrafena cannot fire weapons from any other mount until the end of the current turn.",
                "synergies": [
                    {
                        "locations": ["weapon"],
                        "detail": "After firing a weapon, you cannot fire weapons from any other mount until the end of the current turn."
                    }
                ]
            },
            {
                "name": "Reactive Thrusters",
                "description": "When the Akrafena Boosts, it cannot be knocked back, pushed, pulled, or be knocked prone by actors up to its size +1 (rounded up) until the start of its next turn.",
                "synergies": [
                    {
                        "locations": ["boost"],
                        "detail": "After you boost you cannot be knocked back, pushed, pulled or knocked prone by actors up to your size +1 (rounded up) until the start of your next turn."
                    }
                ]
            },
            {
                "name": "Slow",
                "description": "The Akrafena has +1 Difficulty on agility checks and saves.",
                "synergies": [
                    {
                        "locations": ["agility","skill_check"],
                        "detail": "Gain +1 Difficulty on AGILITY checks and saves."
                    }
                ]
            },
            {
                "name": "MOUNT RULES",
                "description": "Hi, this is here to tell you that the 4 main mounts are - in fact - 2 Main/Main mount. Its Aux/Aux but with Mains!<br>The the two on the left half are as far as the rules are concerned linked (so if you have two loading weapons and fire that mount they're both unloaded), same goes for the pair on the right.<br>Apologies that this couldn't be done in a cleaner way - maybe in the future"
            }
        ],
        "core_system": {
            "name": "PEDIPALPS Augmented Hardpoints",
            "description": "Integrated additional limbs and recoil stabilizers allow a terrifying volume of sustained fire. During spikes of reactor activity, static defense capabilities surge as weapons are reloaded by tertiary limbs as fast as they cycle.",
            "active_name": "Synchronize Limbs",
            "active_effect": "After using this protocol, for the rest of this scene, the Akrafena can fire 2 weapons and reload 2 weapons when it uses Lock And Cycle.",
            "use": "Encounter",
            "activation": "Protocol",
            "passive_name": "Lock And Cycle",
            "passive_actions": [
                {
                    "name": "Lock And Cycle",
                    "activation": "Full",
                    "detail": "The Akrefena fires a weapon and reloads a weapon as a Full Action. This counts as a Barrage. The Akrefena is Slowed until the start of its next turn after using this action."
                }
            ]
        }
    },
    {
        "id": "bdf_dao",
        "license_level": 2,
        "source": "BDF",
        "name": "DAO",
        "mechtype": ["Support"],
        "y_pos": 0,
        "description": "",
        "mounts": ["Main","Main/Aux"],
        "stats": {
            "size": 2,
            "structure": 4,
            "stress": 4,
            "armor": 1,
            "hp": 8,
            "evasion": 7,
            "edef": 9,
            "heatcap": 5,
            "repcap": 3,
            "sensor_range": 12,
            "tech_attack": 1,
            "save": 10,
            "speed": 4,
            "sp": 7
        },
        "traits": [
            {
                "name": "My Precious",
                "description": "Drones the Dao controls have +2 HP and +2 Evasion and +2 E-Defense",
                "bonuses": [
                    {
                        "id": "deployable_hp",
                        "val": 2
                    },
                    {
                        "id": "deployable_evasion",
                        "val": 2
                    },
                    {
                        "id": "deployable_edef",
                        "val": 2
                    }
                ]
            },
            {
                "name": "Bottom Heavy",
                "description": "The Dao is Immobilized when Prone. It can still stand up from Prone."
            },
            {
                "name": "Guardian",
                "description": "Adjacent allies may use the Dao as Hard Cover."
            }
        ],
        "core_system": {
            "name": "PLACEHOLDER-pattern Subaltern Drone Systems",
            "description": "",
            "active_name": "Full Deployment",
            "active_effect": "Create 3 additional Subaltern Drones. In addition, gain the Shed Armor reaction.",
            "active_actions": [
                {
                    "name": "Shed Armor",
                    "activation": "Reaction",
                    "frequency": "1/scene",
                    "trigger": "You are hit by an attack or fail a hostile save and learn the damage or hostile effect.",
                    "detail": "Become Immune to the attack or save’s damage, heat, and all other effects. Until the end of the scene, after activating this reaction, your size is reduced by 1, your armor is reduced by 1, and you gain 2 speed.  A size 2 object is created in an adjacent square that grants Hard Cover as well as resistance to all damage and heat to characters behind it."
                }
            ],
            "use": "Encounter",
            "activation": "Quick",
            "passive_name": "Subaltern Drone Systems",
            "deployables": [
                {
                    "name": "Subaltern Drone",
                    "type": "Drone",
                    "detail": "1/round per Subaltern Drone, This drone can attack targets within Range 8 of it against Evasion for 3 KINETIC damage as a free action.",
                    "activation": "Full",
                    "size": 0.5,
                    "hp": "10 + {grit}",
                    "edef": "your mech's",
                    "evasion": "your mech's",
                    "speed": "your mech's"
                }
            ],
            "passive_effect": "Your mech can print independent Drone companions. This drone can be deployed in an adjacent space and move on your turn. The Subaltern Drone shares your EVASION, E-DEFENSE, and SPEED. Begin the scene with 1 Subaltern Drone already in play."
        }
    },
    {
        "id": "bdf_jian",
        "license_level": 2,
        "source": "BDF",
        "name": "JIAN",
        "mechtype": ["Striker"],
        "y_pos": 0,
        "description": "Baronic Unified Command issued procurement for a line mech to rival the capacity of the Harrison Armory Sherman, and the Jian is the BDF’s response.  Designed as a stick and move chassis around a lighter frame with rapid maneuver capability to integrate with infantry deployment, the Jian mounts enough firepower to disable softer armored targets and enough supplemental",
        "mounts": ["Main","Main"],
        "stats": {
            "size": 1,
            "structure": 4,
            "stress": 4,
            "armor": 0,
            "hp": 10,
            "evasion": 9,
            "edef": 7,
            "heatcap": 6,
            "repcap": 4,
            "sensor_range": 8,
            "tech_attack": -1,
            "save": 11,
            "speed": 4,
            "sp": 6
        },
        "traits": [
            {
                "name": "Experimental Munitions",
                "description": "Grenades have extra throw range equal to the last movement you made in a straight line. If you choose to Immobilize yourself until the start of your next turn when throwing a grenade, the grenade explodes with extra force, creating an additional Blast 1 area in the target space. Targets caught inside the area are knocked back 1 space and take 1d6 Explosive damage or half damage on a successful AGILITY save."
            },
            {
                "name": "Combat Roll",
                "description": "Gain the Do A Flip! reaction",
                "actions": [{
                    "name": "Do A Flip!",
                    "activation": "Reaction",
                    "frequency": "1/turn",
                    "trigger": "When an attack misses you or you are knocked back",
                    "detail": "Move 1 space. If this causes you to collide with an object or piece of terrain, deal 10 AP KINETIC damage to that object or piece of terrain."
                }]
            },
            {
                "name": "Combat Bandolier",
                "description": "The Jian has +2 to Limited Systems and Weapons. It suffers +1 Knockback from all sources of Knockback.",
                "bonuses": [
                    {
                        "id": "limited_bonus",
                        "val": 2
                    }
                ]
            }
        ],
        "core_system": {
            "name": "Deployable Mechanized Combat Vehicle",
            "description": "While mechanized cavalry chassis legs are a tangible advantage in rugged terrain, open plains and paved roads require additional tools to compete with armor. Specialized modular drones can reconfigure to allow for rapid deployment of frames and dismounted pilots alike.",
            "active_name": "“Moonlight” Combat Cycle",
            "active_effect": "Deploy two Line 2 Drones with 20HP into adjacent free and valid spaces - they can combine as a Protocol to hold a size 2 actor or they can hold 1 size 1 or ½ actor each. A character may mount either of them as a Quick Action. You may move each of the drones up to 6 spaces at the start of your turn (independently if they aren’t linked) and you can fire a Line 5 machine gun from each Cycle for 2 KINETIC damage as a protocol. You can prime a Self Destruct on each drone seperately as a Quick Action.",
            "use": "Encounter",
            "activation": "Protocol",
            "integrated": ["bdf_coin_grenade"]
        }
    },
    {
        "id": "bdf_kampilan",
        "license_level": 2,
        "source": "BDF",
        "name": "KAMPILAN",
        "mechtype": ["Support","Controller"],
        "y_pos": 0,
        "description": "The Ungratefuls uprising across the Baronies requires infantry augmentation beyond the capabilities of a single hardsuit. Companies of warrior-pattern Kampilan chassis were deployed en masse and found lacking in operational capacity, as the high powered lasers they carried required frequent resupply and their command structure reliant on omninet connection - a favorite target of HORUS. Despite a projected success rate of 10%, the Kampilan scout-pattern pilots came back from each sortie the sole survivors. Distant and aloof, unwilling to discuss what happened in the tunnels of Free Sanjak, the craters of the Dawnline Shore, or in the palaces of Throne Karrakis, Baronic Unified Command continues to accumulate telemetry to tune the frame’s performance further beyond factory spec.",
        "mounts": ["Aux/Aux","Aux/Aux"],
        "stats": {
            "size": 0.5,
            "structure": 4,
            "stress": 4,
            "armor": 0,
            "hp": 6,
            "evasion": 9,
            "edef": 7,
            "heatcap": 5,
            "repcap": 6,
            "sensor_range": 15,
            "tech_attack": 1,
            "save": 10,
            "speed": 5,
            "sp": 8
        },
        "traits": [
            {
                "name": "Electronic Impulse Muscles",
                "description": "1/round, if a character fails a save against you the Kampilan gains +1d6 bonus damage and +1 knockback on its next attack.",
                "synergies": [
                    {
                        "locations": ["weapon"],
                        "detail": "1/round, if a character fails a save against you the Kampilan gains +1d6 bonus damage and +1 knockback on its next attack."
                    }
                ]
            },
            {
                "name": "Statistical Anomaly",
                "description": "The Kampilan never rolls more than one die for Structure checks and only costs 2 repairs to repair Destroyed status.",
                "synergies": [
                    {
                        "locations": ["structure"],
                        "detail": "The Kampilan never rolls more than one die for Structure checks."
                    },
                    {
                        "locations": ["rest"],
                        "detail": "The Kampilan only costs 2 repairs to repair Destroyed status."
                    }
                ]
            },
            {
                "name": "Plasteel Frame",
                "description": "If the Kampilan moves at least 6 spaces in a round, 1/round it can move 3 spaces in the same direction as its last movement as a free action.",
                "use": "Free"
            }
        ],
        "core_system": {
            "name": "",
            "description": "",
            "active_name": "Subjectivity Diffusion Engine",
            "active_effect": "1/scene, the Kampilan pilot can choose to overcharge the coldcore reactor on the frame. This causes the mech to prime a Self Destruct with a Blast 4 profile instead of a Blast 2. The Self Destruct activates immediately if the pilot Ejects or if the frame experiences a Direct Hit roll on a Structure Check. Unlike a normal Self Destruct, this leaves behind a Destroyed mech wreck. After Dismounting or Ejecting, until the end of the scene the Kampilan’s pilot can make Improvised Attack actions as if mounted, using the mech traits, systems, and mech talents of the Kampilan.",
            "use": "Encounter",
            "activation": "Full",
            "integrated": ["bdf_disposable_binary_laser_rifle"],
            "active_synergies": [
                {
                    "locations": ["active_effects"],
                    "detail": "1/scene, the Kampilan pilot can choose to overcharge the coldcore reactor on the frame. This causes the mech to prime a Self Destruct with a Blast 4 profile instead of a Blast 2. The Self Destruct activates immediately if the pilot Ejects or if the frame experiences a Direct Hit roll on a Structure Check. Unlike a normal Self Destruct, this leaves behind a Destroyed mech wreck. After Dismounting or Ejecting, until the end of the scene the Kampilan’s pilot can make Improvised Attack actions as if mounted, using the mech traits, systems, and mech talents of the Kampilan."
                }
            ]
        }
    },
    {
        "id": "bdf_khanda",
        "license_level": 2,
        "source": "BDF",
        "name": "KHANDA",
        "mechtype": ["Striker","Artillery"],
        "y_pos": 0,
        "description": "",
        "mounts": ["Heavy","Heavy"],
        "stats": {
            "size": 2,
            "structure": 4,
            "stress": 4,
            "armor": 1,
            "hp": 8,
            "evasion": 7,
            "edef": 7,
            "heatcap": 5,
            "repcap": 4,
            "sensor_range": 12,
            "tech_attack": -1,
            "save": 10,
            "speed": 3,
            "sp": 5
        },
        "traits": [
            {
                "name": "Parallel Processors",
                "description": "The Khanda gains +1 accuracy on attacks when consuming Lock On.",
                "synergies": [
                    {
                        "locations": ["weapon"],
                        "detail": "The Khanda gains +1 accuracy on attacks when consuming Lock On."
                    }
                ]
            },
            {
                "name": "Joint Thrusters",
                "description": "When the Khanda jumps, it may fly 3 spaces.",
                "synergies": [
                    {
                        "locations": ["move","boost"],
                        "detail": "When the Khanda jumps, it may fly 3 spaces."
                    }
                ]
            },
            {
                "name": "Load Balancing",
                "description": "The Khanda cannot mount Superheavy weapons and is Immobilized until the start of its next turn if it takes falling damage."
            }
        ],
        "core_system": {
            "name": "",
            "description": "",
            "active_name": "All Power To Main Cannons!",
            "active_effect": "Immediately fire the Aura Missile Launcher 6 times anywhere within range without needing to consume Lock On. Until the end of the scene all Blasts from the Aura Missile Launcher leave behind Dangerous Terrain.",
            "use": "Encounter",
            "activation": "Full",
            "integrated": ["bdf_aura_missile_launcher"]
        }
    },
    {
        "id": "bdf_klewang",
        "license_level": 2,
        "source": "BDF",
        "name": "KLEWANG",
        "mechtype": ["Striker","Controller"],
        "y_pos": 0,
        "description": "A repurposed cargo loader frame, the Klewang is designed to close the gap under fire from enemy artillery to break the defensive lines, allowing infantry to surge through.",
        "mounts": ["Flex","Main","Heavy"],
        "stats": {
            "size": 3,
            "structure": 4,
            "stress": 4,
            "armor": 2,
            "hp": 9,
            "evasion": 6,
            "edef": 6,
            "heatcap": 5,
            "repcap": 6,
            "sensor_range": 15,
            "tech_attack": -2,
            "save": 10,
            "speed": 2,
            "sp": 5
        },
        "traits": [
            {
                "name": "Agressive Underhooks",
                "description": "The Klewang has +1 Accuracy on HULL saves and checks while Grappling and can maintain active Grapples at up to range 3 (the Klewang losing adjacency does not break Grapples until the grapple participant is 4 or more spaces away).",
                "synergies": [
                    {
                        "locations": ["hull","skill_check"],
                        "detail": "The Klewang has +1 Accuracy on HULL saves and checks while Grappling"
                    },
                    {
                        "locations": ["grapple"],
                        "detail": "The Klewang has +1 Accuracy on HULL saves and checks while Grappling and can maintain active Grapples at up to range 3 (the Klewang losing adjacency does not break Grapples until the grapple participant is 4 or more spaces away)."
                    }
                ]
            },
            {
                "name": "Follow-Through",
                "description": "The Klewang can move 2 spaces when hitting with a melee attack; this movement must be directly towards an enemy character (not necessarily the original target). Additionally, if the Klewang moves at least 4 spaces in a round, 1/round it can move 2 additional spaces as a free action.",
                "use": "Free",
                "synergies": [
                    {
                        "locations": ["weapon"],
                        "detail": "The Klewang can move 2 spaces when hitting with a melee attack; this movement must be directly towards an enemy character (not necessarily the original target)."
                    }
                ]
            },
            {
                "name": "Top Heavy",
                "description": "The Klewang has +1 Difficulty on all saves vs Prone, Knockback, or Involuntary Movement.",
                "synergies": [
                    {
                        "locations": ["skill_check"],
                        "detail": "The Klewang has +1 Difficulty on all saves vs Prone, Knockback, or Involuntary Movement."
                    }
                ]
            }
        ],
        "core_system": {
            "name": "Crane Game Actuators",
            "description": "Mechs aren’t supposed to bend like that.",
            "active_name": "Six Meters Under",
            "active_effect": "Until the end of the scene, the Klewang creates a Cone 5 shockwave for 2d6 Explosive damage when it activates Suplex or Boosts in the direction of the nearest enemy character. Characters caught in the area who pass a HULL save take half damage.",
            "use": "Encounter",
            "activation": "Full",
            "passive_name": "Piledriver Protocols",
            "passive_effect": "The Klewang gains access to the Piledriver Full Action",
            "passive_actions": [
                {
                    "name": "Piledriver",
                    "activation": "Full",
                    "detail": "Fly 3 spaces and initiate a Grapple; if the attack roll is successful, the target is Grappled and the Klewang may switch positions with the Grapple target, placing it in an adjacent square of the Klewang’s choice. Hit or miss, the target is Prone. On a miss, the Klewang is also Prone."
                }
            ]
        }
    },
    {
        "id": "bdf_macuahuitl",
        "license_level": 2,
        "source": "BDF",
        "name": "MACUAHUITL",
        "mechtype": ["Artillery"],
        "y_pos": 0,
        "description": "",
        "mounts": ["Flex","Main","Heavy"],
        "stats": {
            "size": 3,
            "structure": 4,
            "stress": 4,
            "armor": 2,
            "hp": 10,
            "evasion": 6,
            "edef": 12,
            "heatcap": 8,
            "repcap": 4,
            "sensor_range": 10,
            "tech_attack": 0,
            "save": 10,
            "speed": 2,
            "sp": 6
        },
        "traits": [
            {
                "name": "Stable Footing",
                "description": "The Macuahuitl has +1 Difficulty on attacks when not on level ground. 1/round The Macuahuitl may gain +1 Accuracy on attacks when on level ground.",
                "synergies": [
                    {
                        "locations": ["weapon"],
                        "detail": "The Macuahuitl has +1 Difficulty on attacks when not on level ground. 1/round The Macuahuitl may gain +1 Accuracy on attacks when on level ground."
                    }
                ]
            },
            {
                "name": "Leg Room",
                "description": "You have an Integrated Expanded Compartment and can mount an additional NHP in addition to any other bonuses.",
                "bonuses": [
                    {
                        "id": "ai_cap",
                        "val": 1
                    }
                ],
                "integrated": ["ms_expanded_compartment"]
            },
            {
                "name": "Top Heavy",
                "description": "The Macuahuitl has +1 Difficulty on all saves vs Prone, Knockback, or Involuntary Movement.",
                "synergies": [
                    {
                        "locations": ["skill_check"],
                        "detail": "The Macuahuitl has +1 Difficulty on all saves vs Prone, Knockback, or Involuntary Movement."
                    }
                ]
            }
        ],
        "core_system": {
            "name": "placeholder",
            "description": "<i></i>",
            "active_name": "Fire The Big Gun",
            "active_effect": "All attacks gain Blast 1 and Knockback 2. You may also fire The Big Gun until the end of the scene after activating this Core Power.",
            "use": "Encounter",
            "activation": "Protocol",
            "passive_name": "Integrated NHP Copilot",
            "passive_effect": "As a Protocol choose 1 of the listed effects per equipped AI: <li>Decrease the Reload Die by 1. When the Reload Die hits 0 you may reload a Loading weapon of your choice, the Reload Die is then set to 2<li>Gain +2 speed for round<li>Gain Accurate on 1 mount",
            "integrated": ["bdf_big_gun"]
        }
    },
    {
        "id": "bdf_shotel",
        "license_level": 2,
        "source": "BDF",
        "name": "SHOTEL",
        "mechtype": ["Striker"],
        "y_pos": 0,
        "description": "",
        "mounts": ["Main","Main"],
        "stats": {
            "size": 0.5,
            "structure": 4,
            "stress": 4,
            "armor": 0,
            "hp": 6,
            "evasion": 10,
            "edef": 6,
            "heatcap": 7,
            "repcap": 3,
            "sensor_range": 8,
            "tech_attack": 0,
            "save": 10,
            "speed": 4,
            "sp": 6
        },
        "traits": [
            {
                "name": "HiveFlight Boosters",
                "description": "The Shotel can fly when it moves. When it begins the turn flying and lands after moving at least 2 spaces, its next attack can be drawn from a space half that many spaces away in the same direction as the Shotel’s last movement and within line of sight.",
                "synergies": [
                    {
                        "locations": ["move","boost"],
                        "detail": "The Shotel can fly when it moves. When it begins the turn flying and lands after moving at least 2 spaces, its next attack can be drawn from a space half that many spaces away in the same direction as the Shotel’s last movement and within line of sight."
                    }
                ]
            },
            {
                "name": "Heat Bleed",
                "description": "At the end of its turn, the Shotel cools 2 Heat. When it takes stress or structure damage, this effect ceases until the end of its next turn.",
                "synergies": [
                    {
                        "locations": ["heat","stress","structure"],
                        "detail": "At the end of its turn, the Shotel cools 2 Heat. When it takes stress or structure damage, this effect ceases until the end of its next turn."
                    }
                ]
            },
            {
                "name": "Exposed Reactor",
                "description": "The Shotel receives +1 Difficulty on Engineering checks and saves.",
                "synergies": [
                    {
                        "locations": ["engineering","skill_check"],
                        "detail": "The Shotel receives +1 Difficulty on Engineering checks and saves."
                    }
                ]
            }
        ],
        "core_system": {
            "name": "",
            "description": "",
            "active_name": "Pandora's Pepperbox",
            "active_effect": "Your Heat cools to zero. Choose a space within Range 5 and mark a Cone 7 area; at start of your next two turns, all characters and objects caught inside take on failed Agility save take 2d6 Energy plus your Heat value when you activated this protocol, and half damage on a successful save.",
            "use": "Round",
            "activation": "Protocol"
        }
    }
]