[
    {
        "id": "bdf_splendor_mod",
        "name": "Splendor Mod",
        "sp": 2,
        "tags": [{"id": "tg_unique"}],
        "allowed_types": ["Launcher","Nexus"],
        "source": "BDF",
        "license": "AKINAKA",
        "license_level": 2,
        "effect": "Attacks with this weapon count as AoEs for the purposes of resistance/vulnerability to AoEs (e.g. The Drake and Squads), and allow you to make attacks against characters with the Hidden status.",
        "actions": [
            {
                "name": "Mark of Splendor",
                "activation": "Passive",
                "detail": "On hit you may mark an enemy with the Mark of Splendor. Only one mark may be active at a time."
            },
            {
                "name": "Splendid Blaze",
                "activation": "Quick",
                "detail": "Detonate the Mark of Splendor to deal 2 <b>EXPLOSIVE</b> damage to the Marked character and all characters within Burst 2 of them."
            }
        ],
        "description": "<i>A weapon fit for a Baron needs appropriate visual and pyrotechnic glory. The “Splendor” line of weapon upgrades was commissioned by the House of Shattered Dreams to provide a noble’s share of kinetovisual glory to the aesthetics of a chassis scale weapon without compromising performance.</i>"
    },
    {   
        "id": "bdf_heartpiercer",
        "name": "Heartpiercer Mod",
        "sp": 2,
        "tags": [{"id": "tg_unique"}],
        "allowed_types": ["Melee"],
        "source": "BDF",
        "license": "AKRAFENA",
        "license_level": 2,
        "actions": [
            {
                "name": "Pierce The Heart",
                "activation": "Quick",
                "frequency": "1/round",
                "detail": "Your next attack with this weapon allows you to lunge two spaces towards your attack target (ignoring reactions) and adds +2 Knockback. If the target collides with a wall, object, or character, the target must pass a hull save or take 1d6 Kinetic damage and be knocked Prone."
            }
        ],
        "description": "<i>Secondary thrusters and experimental chemical catalysts allow pilots to leverage forward momentum with their weapon attacks into a devastating charge. Pilots of Afenatene-pattern Akrafena are cleared to use this mod, as it exposes the pilot to great risk of counter-attack.</i>"
    },
    {   
        "id": "bdf_laser_guided_mod",
        "name": "Laser Guided Mod",
        "sp": 2,
        "tags": [{"id": "tg_unique"}],
        "allowed_types": ["CQB","Launcher","Nexus"],
        "source": "BDF",
        "license": "JIAN",
        "license_level": 2,
        "added_tags": [{"id": "tg_arcing"}],
        "actions": [
            {
                "name": "Laser Guided Course Correction",
                "activation": "Quick",
                "frequency": "1/round",
                "trigger": "You miss your initial attack target.",
                "detail": "You may reroll the attack against one enemy within Range 5 of the original target. The new target can be outside the attack area of a templated weapon, as long as it is within Range 5 of the original target."
            }
        ],
        "description": "<i>Double double capacity munitions loads were not enough to sustain field operations in high intensity firefights, so BDF engineers turned towards active guidance of payloads as a way to improve ammunition efficiency. Particularly rich barons use the laser guidance to spell out the heraldry of their minor Houses prior to payload delivery.</i>"
    },
    {   
        "id": "bdf_impact_mod",
        "name": "High Philosophy Mod",
        "sp": 2,
        "tags": [{"id": "tg_unique"}],
        "allowed_types": ["Cannon","CQB","Launcher"],
        "source": "BDF",
        "license": "KHANDA",
        "license_level": 2,
        "effect": "On a Critical Hit, you can force your target to pass a HULL save or become Immobilized and Slowed until the end of their next turn.",
        "actions": [
            {
                "name": "Acidic Communications",
                "activation": "Passive",
                "detail": "On a Critical Hit, you can force your target to pass a Hull Save or become Immobilized and Slowed until the end of their next turn."
            }
        ],
        "description": "<i>The minor House of Assonance, notorious for elaborate wordplay during battle, modified their munitions to disperse hostile code into enemy computers upon impact in a manner not intended to breach firewalls but etiquette by flashing stunning insults across their screens on impact.  Other Houses have implemented the High Philosophy munitions into fireworks during particularly tense anniversary celebrations.</i>"
    },
    {
        "id": "bdf_crater_mod",
        "name": "Crater Mod",
        "sp": 2,
        "tags": [{"id": "tg_unique"}],
        "source": "BDF",
        "license": "KIEM",
        "license_level": 2,
        "restricted_types": ["Melee"],
        "effect": "Choose a Ranged Weapon. Your attacks with that weapon now affect and damage ground tiles and terrain. 1/round, cause 2d6 AP Explosive bonus damage to the ground tiles, objects and terrain in the area of effect. Destroy 1 depth of ground tile spaces inside the area for every 10 damage dealt to the ground. Single target weapons apply this bonus damage to a single ground or terrain space the target occupies.",
        "description": "<i>The minor House of Pressure developed a series of increasingly volatile mine defusal ordnance which resulted in far more damage than the mines themselves would have caused.  BDF engineers saw an opportunity for mech-scale terraforming and terrain restructuring, allocating print requests for these modifications only to the most decorated and stable soldiers in the field.</i>"
    },
    {
        "id": "bdf_spin_up_mod",
        "name": "Spin-Up Mod",
        "sp": 2,
        "tags": [{"id": "tg_unique"}],
        "source": "BDF",
        "license": "KIEM",
        "license_level": 3,
        "added_tags": [{"id": "tg_ordnance"}],
        "restricted_sizes": ["Superheavy"],
        "effect": "Choose one Auxiliary, Main, or Heavy weapon <b>with the Loading tag</b>. <b>Please double check that your weapon is Loading before using this mod!</b><br>It gains the Ordnance tag. When firing this weapon, as a Quick Action you may ignore the Loaded status to immediately fire the weapon again for half damage. This Quick Action ignores the Ordnance restriction on being the first action of the turn.",
        "actions": [
            {
                "name": "Additional Firepower",
                "activation": "Quick",
                "detail": "You may ignore the Loaded status to fire the weapon again for half damage. This Quick Action ignores the Ordnance restriction on being the first action of the turn.<br>You may use this Quick Action on subsequent turns to ignore the LOADED status and fire the weapon for half damage and heat, until the weapon is reloaded."
            }
        ],
        "description": "<i>Quantity of fire is its own quality of fire.  BDF engineers are able to modify ordnance to streamline ammo feeds and increase reserves to allow suppressive fire long beyond factory limits.</i>"
    }
]