[
    {   "id": "bdf_laser_mortar",
        "name": "Laser Mortar",
        "mount": "Main",
        "type": "Cannon",
        "range": [{"type": "Range","val": 5},{"type": "Cone","val": 3}],
        "damage": [{"type": "Energy","val": "1d3+2"}],
        "tags": [{"id": "tg_loading"},{"id": "tg_inaccurate"},{"id": "tg_arcing"}],
        "effect": "This weapon can make two attacks when fired. The attack areas cannot overlap.",
        "source": "BDF",
        "license": "AKRAFENA",
        "license_level": 1,
        "talent_item": false,
        "description": "<i>Traditional mortar propulsion of discs of reflective mirrors followed by a directed energy blast allow a wide area dispersal of fire from angles traditional armor configurations neglect or cannot cover efficiently. Reports of captured ordnance used for dance parties by Ungrateful cells are not verified and should not be disseminated over the omninet.</i>",
        "data_type": "weapon",
        "aptitude": {}
    },
    {   "id": "bdf_swds",
        "name": "Silk Web Defense Screen",
        "mount": "Main",
        "type": "Melee",
        "range": [{"type": "Threat","val": 1}],
        "damage": [{"type": "Kinetic","val": "1d3+1"}],
        "tags": [{"id": "tg_knockback","val": 2}],
        "effect": {
            "name":"Momentum Riposte",
            "effect_type": "Reaction",
            "frequency": "1/round",
            "trigger": "An enemy within Range 5 targets you with an attack.",
            "detail": "You may take 1d6 AP Energy damage to interrupt it and Skirmish with the Silk Web Defense Screen, regardless if the enemy is in range of the weapon.<br>On hit, the target character’s attack will be reflected back at it for half damage, Heat, and Burn, and you, not the enemy, can be pushed directly away by the combined value of the enemy attack’s knockback and your own knockback."
        },
        "source": "BDF",
        "license": "AKRAFENA",
        "license_level": 2,
        "talent_item": false,
        "description": "<i>Derived from hardlight, a combination of a plassteel outer frame and electrically charged webbed nanites allow projection of an ionic field to magnetically redirect attacks away from the pilot and lend additional momentum to defensive strikes. The high risk of these maneuvers results in a statistically significant increase in variance of maintenance time for frames using this system.</i>",
        "data_type": "weapon",
        "aptitude": {}
    },
    {   "id": "bdf_starpoint",
        "name": "Starpoint Spear",
        "mount": "Main",
        "type": "Melee",
        "range": [{"type": "Threat","val": 1}],
        "damage": [{"type": "Explosive","val": "1d6+2"}],
        "tags": [{"id": "tg_unique"}],
        "effect": "This weapon begins with 4 charges (Use a die to track this). After firing this weapon, decrease the number of charges by 1. When the number of charges is odd, this weapon deals +1d6 bonus damage, costs 1 Heat to fire, and gains +2 Threat. When the number of charges reaches 1, gain the Loading tag. Reloading this weapon resets the number of charges to 4 and removes the Loading tag.",
        "source": "BDF",
        "license": "AKRAFENA",
        "license_level": 3,
        "talent_item": false,
        "description": "<i>Concentrated plasma magnetically accelerated to a pointed tip allows for a breaching tool design that can capitalize on the momentum from prior applications.  Care must be used to ensure uptime, as the weapon contains a limited amount of fuel before it must be reloaded.</i>",
        "data_type": "weapon",
        "aptitude": {}
    },
    {   "id": "bdf_binary_laser",
        "name": "Binary Laser Rifle",
        "mount": "Auxiliary",
        "type": "Rifle",
        "range": [{"type": "Range","val": 5}],
        "damage": [{"type": "Energy","val": 3}],
        "tags": [{"id": "tg_ap"},{"id": "tg_limited","val": 6}],
        "effect": [{
            "effect_type": "Basic",
            "detail": "This weapon mount can be chosen to be destroyed on a “Weapon Destroyed” structure roll. When destroyed or when out of charges, changes to the Rifle Butt Profile."
            },{
                "effect_type": "Profile",
                "name": "Rifle Butt",
                "range": [{
                    "type": "Threat",
                    "val": 1
                }],
                "damage": [{
                    "type": "kinetic",
                    "val": "1d3"
                }],
                "detail":  "Attacking with this weapon counts as an Improvised Attack."
            }
        ],
        "talent_item": false,
        "description": "<i></i>",
        "data_type": "weapon",
        "aptitude": {}
    },
    {   "id": "bdf_plasma_cannon",
        "name": "Plasma Cannon",
        "mount": "Main",
        "type": "Cannon",
        "range": [{"type": "Range","val": 10},{"type": "Blast","val": 1}],
        "damage": [{"type": "Energy","val": "1d6"}],
        "tags": [{"id": "tg_heat_self","val": 1}],
        "effect": "This weapon can be charged with a Quick Action and to increase its area of effect to Blast 2.",
        "source": "BDF",
        "license": "Shotel",
        "license_level": 1,
        "talent_item": false,
        "description": "<i>Conventional shoulder-mounted anti-armor launchers reworked into man-portable party cannons</i>",
        "data_type": "weapon",
        "aptitude": {}
    },
    {   "id": "bdf_laser_chainsaw",
        "name": "Laser Chainsaw",
        "mount": "Main",
        "type": "Melee",
        "range": [{"type": "Threat","val": 1}],
        "damage": [{"type": "Energy","val": "1d6+2"}],
        "tags": [{"id": "tg_heat_self","val": 3}],
        "effect": "This weapon attacks additional targets in a Line 3 area originating from your target; if you are at a higher elevation than your first target when you attack, this weapon can attack as a Cone 3.",
        "source": "BDF",
        "license": "Shotel",
        "license_level": 2,
        "talent_item": false,
        "description": "<i>Coldcore reactor bleed funneled through plasma capillaries and cycled away from the frame creates directed bursts of energy. These “blades” are weaponized by daredevil pilots in close combat; by directing the intense energy into another solid target and not radiating the waste heat in the air, these pilots actually impede heat diffusion in their own frame.</i>",
        "data_type": "weapon",
        "aptitude": {}
    },
    {   "id": "bdf_thunder_stinger",
        "name": "Thunder Stinger",
        "mount": "Main",
        "type": "CQB",
        "range": [{"type": "Range","val": 1}],
        "damage": [{"type": "Burn","val": 2}],
        "tags": [{"id": "tg_heat_self","val": 6}],
        "effect": "When you attack with this weapon, make a Cone 3 attack and a Cone 5 attack originating from the space of your attack, in the same direction as your attack. Make attack rolls for each target caught in each area; this can hit the same target multiple times. The Cone 3 and Cone 5 secondary attacks do 1d6 Energy each.",
        "source": "BDF",
        "license": "Shotel",
        "license_level": 3,
        "talent_item": false,
        "description": "<i>The Thunder Stinger is a crossbow-shaped weapon using an enormous magnet to shape electrical discharges from ionized rails.  The rapid diffusion of energy into the air limits operational effectiveness, and only the most reckless Shotel pilots utilize this weapon, as the Baronies never procured it for mass production.</i>",
        "data_type": "weapon",
        "aptitude": {}
    }
]